Конфигурация/DataProcessors/КонтрольСЧА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>КонтрольСЧА</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодКонтроля</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РезультатыПроверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегистрацияСтоимостиАктивов</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РегистрацияСтоимостиАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СЧА_Расчетная</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РСА_Расчетная</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресВХранилище</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРасчетаСЧА</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеРассчитанаСЧА</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеЗаданыНастройки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РСА_Текущая</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СЧА_Текущая</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СЧА_СуммаАктивов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РСА_СуммаАктивов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИднетификаторРезультата</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация/InformationRegisters/ХранилищеЗначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ХранилищеЗначений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ХранилищеЗначения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУдалять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыОтбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>90</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ФинансовыеПоказатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ФинансовыеПоказатели</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубъектАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
						<v8:Type>cfg:CatalogRef.СтратегииИндивидуальногоИнвестирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПоказателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыФинансовыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтоимостьАктивовНеОтносящихсяКЦеннымБумагам</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаРынок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРынокВВалютеУчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРезерваВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УровеньОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАктива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАктивов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубъектАналитики</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СубъектыАналитики</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеСтоимостиАктивов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
						<v8:Type>cfg:CatalogRef.Резервы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/НастройкиФормированияСЧА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НастройкиФормированияСЧА</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодичностьРасчетаСЧА</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРегламентныхДействий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРасчетныйКупон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НКДВСправедливойСтоимостиЦБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантРасчетаПроцентовПоСделкамРЕПО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаПроцентовПоСделкамРЕПО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочностьРасчетнойСтавкиРЕПО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КритерийСущественностиОтклоненияССТПлюс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьНастройкиУчетнойПолитикиЕПС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьНачисленияРезервов</Name>
					<Comment>#538027</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КорзинаОФЗПК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КорзиныОФЗПК</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/DataProcessors/КонтрольСЧА/Ext/ManagerModule.bsl
#Область Обработчики_фоновых_заданий

Функция ПроверитьТаблицу(Параметры, АдресХранилища) Экспорт

	ТаблицаДляПроверки = Параметры.ТаблицаДляПроверки;
	ТаблицаДляПроверки.Колонки.Добавить("ИдентификаторЗадания", Новый ОписаниеТипов("УникальныйИдентификатор"));	
	
	СоответствиеАдресов = Новый Соответствие;
	МассивУИДовЗаданий = Новый Массив;
	
	Для каждого ТекСтрока Из ТаблицаДляПроверки Цикл
	
		ПроверитьКоличествоАктивныхЗаданий(Параметры.ИмяПодчиненныхЗаданий, Параметры.КоличествоПараллельныхСеансов, 1);
		
		НовыйАдрес = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
		
		ПараметрыМетода = Новый Массив;
		ПараметрыМетода.Добавить(Новый Структура("Организация, СчетДоверительногоУправления, Период, ИднетификаторРезультата", ТекСтрока.Организация, ТекСтрока.СчетДоверительногоУправления, ТекСтрока.Дата, ТекСтрока.ИднетификаторРезультата));
		ПараметрыМетода.Добавить(НовыйАдрес);
		
		ПараметрыЗадания = Новый Массив;
		ПараметрыЗадания.Добавить("Обработки.КонтрольСЧА.ВыполнитьПроверкуВФоне");
		ПараметрыЗадания.Добавить(ПараметрыМетода);
		
		ФоновоеЗадание = ФоновыеЗадания.Выполнить("СистемныеФункции.ВыполнитьМетодКонфигурации", ПараметрыЗадания,, Параметры.ИмяПодчиненныхЗаданий);
		ТекСтрока.ИдентификаторЗадания = ФоновоеЗадание.УникальныйИдентификатор;
			
	КонецЦикла;
	
	ПроверитьКоличествоАктивныхЗаданий(Параметры.ИмяПодчиненныхЗаданий, 1, 1);
	
	ТекстОшибки = Строка(СостояниеФоновогоЗадания.ЗавершеноАварийно);
	
	Для каждого ТекСтрока Из ТаблицаДляПроверки Цикл
		
		ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ТекСтрока.ИдентификаторЗадания);
		
		Если ФоновоеЗадание = Неопределено Тогда
			
			// так бывает при переполнении истории фоновых заданий
			Запись = РегистрыСведений.ХранилищеЗначений.СоздатьМенеджерЗаписи();
			Запись.Идентификатор = ТекСтрока.ИднетификаторРезультата;
			Запись.Прочитать();
			Если Запись.Выбран() Тогда
				// все ОК, задание отработало и сохранило результат
			Иначе
				// записи нет. Вероятно, задание завершено с ошибкой
				Запись.ХранилищеЗначения 			= Новый ХранилищеЗначения(ТекстОшибки, Новый СжатиеДанных(9));
				Запись.Источник 					= "КонтрольСЧА";
				Запись.Организация	 				= ТекСтрока.Организация;
				Запись.СчетДоверительногоУправления	= ТекСтрока.СчетДоверительногоУправления;
				Запись.Ответственный				= РаботаСПользователями.ТекущийПользователь();
				Запись.Записать();
			КонецЕсли; 
		
		ИначеЕсли ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
		
			Запись = РегистрыСведений.ХранилищеЗначений.СоздатьМенеджерЗаписи();
			Запись.Идентификатор	 			= ТекСтрока.ИднетификаторРезультата;
			Запись.ХранилищеЗначения 			= Новый ХранилищеЗначения(ТекстОшибки, Новый СжатиеДанных(9));
			Запись.Источник 					= "КонтрольСЧА";
			Запись.Организация	 				= ТекСтрока.Организация;
			Запись.СчетДоверительногоУправления	= ТекСтрока.СчетДоверительногоУправления;
			Запись.Ответственный				= РаботаСПользователями.ТекущийПользователь();
			Запись.Записать();
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции
 
Функция ВыполнитьПроверку(Параметры) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("ВидДоговора", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления"));
	
	Отказ = Ложь;
	
	Организация 					= Параметры.Организация;
	СчетДоверительногоУправления 	= Параметры.СчетДоверительногоУправления;
	Период 							= Параметры.Период;
	
	РеквизитыКонтроля = Неопределено;
	Параметры.Свойство("РеквизитыКонтроля", РеквизитыКонтроля); // если свойство есть - пришли сюда из формы документа РСА
	
	ПараметрыРасчета = СформироватьСтруктуруПараметровРасчета(СчетДоверительногоУправления, Период);
	
	Если ТипЗнч(ПараметрыРасчета) = Тип("Структура") Тогда
		
		Если РеквизитыКонтроля = Неопределено Тогда
			МассивСообщений = ПолучитьСообщенияПользователю(Истина);
		КонецЕсли;
		
		РегистрацияСтоимостиАктивов = Неопределено;
		
		УстановитьПривилегированныйРежим(Истина);	
		
		РегистрацияСтоимостиАктивов = Документы.РегистрацияСтоимостиАктивов.СоздатьДокумент();				
		РегистрацияСтоимостиАктивов.Дата                         	= КонецДня(Период);
		РегистрацияСтоимостиАктивов.Организация                  	= Организация;
		РегистрацияСтоимостиАктивов.Ответственный                	= РаботаСПользователями.ТекущийПользователь();
		РегистрацияСтоимостиАктивов.СчетДоверительногоУправления 	= СчетДоверительногоУправления;
		РегистрацияСтоимостиАктивов.ЦельРасчетаСтоимостиОценки 		= ПараметрыРасчета.ЦельРасчета;				

		РегистрацияСтоимостиАктивов.ЗаполнитьДокументыРегистрацииСтоимости(ПараметрыРасчета, Ложь, Отказ);
		
		ФинансовыеПоказателиДоходности = РегистрыСведений.ФинансовыеПоказатели.СоздатьНаборЗаписей().Выгрузить();
		
		Если СчетДоверительногоУправления.ВидДоговораДоверительногоУправления <> Перечисления.ВидыДоговоровДоверительногоУправления.Собственный
		   И Документы.РегистрацияСтоимостиАктивов.ТребуетсяРегистрацияФинансовыхПоказателейДоходности(РегистрацияСтоимостиАктивов.Организация, РегистрацияСтоимостиАктивов.Дата) Тогда
			РегистрацияСтоимостиАктивов.РассчитатьФинансовыеПоказателиДоходности(ФинансовыеПоказателиДоходности, Отказ);
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Ложь);			
		
		Если Отказ Тогда
			
			Если РеквизитыКонтроля = Неопределено Тогда
				МассивСообщений = ПолучитьСообщенияПользователю(Истина);
				ТекстСообщения = "";
				Для каждого Сообщение Из МассивСообщений Цикл
					ТекстСообщения = ТекстСообщения + Символы.ПС + Сообщение.Текст;
				КонецЦикла; 
			КонецЕсли;
			Результат.Вставить("ТекстОшибки", "Не удалось получить расчетные данные для выполнения контроля. Система сообщает:" + ТекстСообщения);
			
		Иначе
			
			Если РеквизитыКонтроля = Неопределено Тогда
				ПолучитьСообщенияПользователю(Истина);
				Для каждого Сообщение Из МассивСообщений Цикл
					Сообщение.Сообщить();
				КонецЦикла; 
			КонецЕсли; 
			
			СтоимостиАктивов = РегистрацияСтоимостиАктивов.АктивыНеОтносящиесяКЦеннымБумагам.Выгрузить();
			СтоимостиАктивов.Свернуть("ВидАктива, СубъектАналитики, Контрагент, Основание, ВидЗадолженности, ВалютаСтроки", "СуммаРынокВВалютеУчета, СуммаРезерваВВалютеУчета");
			
			ДанныеДокумента = Новый Структура("Организация, СчетДоверительногоУправления, СЧАРынок, РСА, СтоимостьПая");
			ЗаполнитьЗначенияСвойств(ДанныеДокумента, РегистрацияСтоимостиАктивов);			
			ДанныеДокумента.Вставить("Период", 						Параметры.Период);
			ДанныеДокумента.Вставить("СтоимостиПереоценки", 		РегистрацияСтоимостиАктивов.ДополнительныеСвойства.РегистрацияСтоимости.СтоимостиПереоценки.Выгрузить());
			ДанныеДокумента.Вставить("СтоимостиПрочихЦенныхБумаг", 	РегистрацияСтоимостиАктивов.ДополнительныеСвойства.РегистрацияСтоимости.СтоимостиПрочихЦенныхБумаг.Выгрузить());
			ДанныеДокумента.Вставить("СтоимостиАктивов", 			СтоимостиАктивов);
			ДанныеДокумента.Вставить("ФинансовыеПоказателиДоходности", ФинансовыеПоказателиДоходности);
			
			СравнитьДанныеДокументаСРегистром(Результат, ДанныеДокумента, РеквизитыКонтроля);		
			
		КонецЕсли; 
					
	Иначе
		Результат.Вставить("ТекстОшибки", ПараметрыРасчета);
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Процедура ВыполнитьПроверкуВФоне(Параметры, АдресХранилища) Экспорт

	Попытка
		Результат = ВыполнитьПроверку(Параметры);
	Исключение
		Результат = Новый Структура("ТекстОшибки", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Запись = РегистрыСведений.ХранилищеЗначений.СоздатьМенеджерЗаписи();
	Запись.Идентификатор	 			= Параметры.ИднетификаторРезультата;
	Запись.ХранилищеЗначения 			= Новый ХранилищеЗначения(Результат, Новый СжатиеДанных(9));
	Запись.Источник 					= "КонтрольСЧА";
	Запись.Организация	 				= Параметры.Организация;
	Запись.СчетДоверительногоУправления	= Параметры.СчетДоверительногоУправления;
	Запись.Ответственный				= РаботаСПользователями.ТекущийПользователь();
	Запись.Записать();

КонецПроцедуры

#КонецОбласти 

Процедура СравнитьДанныеДокументаСРегистром(Результат, ДанныеДокумента, РеквизитыКонтроля)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтоимостиПереоценки", 			ДанныеДокумента.СтоимостиПереоценки);
	Запрос.УстановитьПараметр("СтоимостиПрочихЦенныхБумаг", 	ДанныеДокумента.СтоимостиПрочихЦенныхБумаг);
	Запрос.УстановитьПараметр("СтоимостиАктивов", 				ДанныеДокумента.СтоимостиАктивов);
	
	Запрос.УстановитьПараметр("СЧА_Расчетная", 					ДанныеДокумента.СЧАРынок);
	Запрос.УстановитьПараметр("РСА_Расчетная", 					ДанныеДокумента.РСА);
	Запрос.УстановитьПараметр("СтоимостьПая_Расчетная", 		ДанныеДокумента.СтоимостьПая);
	
	Запрос.УстановитьПараметр("Период", 						ДанныеДокумента.Период);
	Запрос.УстановитьПараметр("Организация", 					ДанныеДокумента.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	ДанныеДокумента.СчетДоверительногоУправления);
	
	Запрос.УстановитьПараметр("ФинансовыеПоказателиДоходности", ДанныеДокумента.ФинансовыеПоказателиДоходности);
	
	#Область ТекстЗапроса
	
	Если РеквизитыКонтроля = Неопределено Тогда
		
		#Область Получение_данных_из_регистра
		// обычный контроль СЧА
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтоимостиАктивов.ВидАктива КАК ВидАктива,
			|	СтоимостиАктивов.СубъектАналитики КАК СубъектАналитики,
			|	СтоимостиАктивов.Контрагент КАК Контрагент,
			|	СтоимостиАктивов.Основание КАК Основание,
			|	СтоимостиАктивов.ВидЗадолженности КАК ВидЗадолженности,
			|	СтоимостиАктивов.Валюта КАК Валюта,
			|	СтоимостиАктивов.СуммаРынокВВалютеУчета КАК СуммаРынокВВалютеУчета,
			|	СтоимостиАктивов.СуммаРезерваВВалютеУчета КАК СуммаРезерваВВалютеУчета 
			|ПОМЕСТИТЬ _СтоимостьАктивовНеЦБПоДаннымУчета
			|ИЗ
			|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостиАктивов
			|ГДЕ
			|	СтоимостиАктивов.Период = &Период
			|	И СтоимостиАктивов.Организация = &Организация
			|	И СтоимостиАктивов.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтоимостьПереоценки.Рынок КАК Рынок,
			|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
			|	СтоимостьПереоценки.Партия КАК Партия,
			|	СтоимостьПереоценки.СтрокаПартии КАК СтрокаПартии,
			|	СтоимостьПереоценки.Цена КАК Цена,
			|	СтоимостьПереоценки.ЦенаКупона КАК ЦенаКупона,
			|	СтоимостьПереоценки.СуммаВВалютеУчета КАК СуммаВВалютеУчета,
			|	СтоимостьПереоценки.СуммаКупонаВВалютеУчета КАК СуммаКупонаВВалютеУчета,
			|	СтоимостьПереоценки.ВидЦены КАК ВидЦены,
			|	СтоимостьПереоценки.УровеньОценки КАК УровеньОценки,
			|	СтоимостьПереоценки.ДатаЦены КАК ДатаЦены,
			|	СтоимостьПереоценки.Источник КАК Источник
			|ПОМЕСТИТЬ _СтоимостьПереоценкиПоДаннымУчета
			|ИЗ
			|	РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
			|ГДЕ
			|	СтоимостьПереоценки.Период = &Период
			|	И СтоимостьПереоценки.Организация = &Организация
			|	И СтоимостьПереоценки.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И СтоимостьПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтоимостьПереоценки.Рынок КАК Рынок,
			|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
			|	СтоимостьПереоценки.Партия КАК Партия,
			|	СтоимостьПереоценки.СтрокаПартии КАК СтрокаПартии,
			|	СтоимостьПереоценки.Цена КАК Цена,
			|	СтоимостьПереоценки.ЦенаКупона КАК ЦенаКупона,
			|	СтоимостьПереоценки.ВидЦены КАК ВидЦены,
			|	СтоимостьПереоценки.УровеньОценки КАК УровеньОценки,
			|	СтоимостьПереоценки.ДатаЦены КАК ДатаЦены,
			|	СтоимостьПереоценки.Источник КАК Источник
			|ПОМЕСТИТЬ _СтоимостьПрочихЦенныхБумагПоДаннымУчета
			|ИЗ
			|	РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
			|ГДЕ
			|	СтоимостьПереоценки.Период = &Период
			|	И СтоимостьПереоценки.Организация = &Организация
			|	И СтоимостьПереоценки.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И СтоимостьПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.КонтрольИнвестиционнойДекларации)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ФинансовыеПоказатели.ВидПоказателя КАК ВидПоказателя,
			|	ФинансовыеПоказатели.Значение КАК Значение,
			|	ЕСТЬNULL(ВЫРАЗИТЬ(ФинансовыеПоказатели.Регистратор КАК Документ.РегистрацияСтоимостиАктивов).РучнойВвод, ИСТИНА) КАК РучнойВвод
			|ПОМЕСТИТЬ _ФинансовыеПоказателиПоДаннымУчета
			|ИЗ
			|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
			|ГДЕ
			|	ФинансовыеПоказатели.Период = &Период
			|	И ФинансовыеПоказатели.Организация = &Организация
			|	И ФинансовыеПоказатели.СубъектАналитики = &СчетДоверительногоУправления
			|	И ФинансовыеПоказатели.ВидПоказателя В (ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок), ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.РыночнаяСтоимостьАктивов), ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьПая))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ФинансовыеПоказатели.ВидПоказателя КАК ВидПоказателя,
			|	ФинансовыеПоказатели.Значение КАК Значение
			|ПОМЕСТИТЬ _ФинансовыеПоказателиДоходностиПоДаннымУчета
			|ИЗ
			|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
			|ГДЕ
			|	ФинансовыеПоказатели.Период = &Период
			|	И ФинансовыеПоказатели.Организация = &Организация
			|	И ФинансовыеПоказатели.СубъектАналитики = &СчетДоверительногоУправления
			|	И ВЫРАЗИТЬ(ФинансовыеПоказатели.СубъектАналитики КАК Справочник.СчетаДоверительногоУправления).ВидДоговораДоверительногоУправления <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
			|	И НЕ ФинансовыеПоказатели.ВидПоказателя В (ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок), ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.РыночнаяСтоимостьАктивов), ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьПая))";			
		#КонецОбласти 
		
	Иначе
		
		#Область Получение_данных_из_документа
		// контроль СЧА из документа РСА
		Запрос.УстановитьПараметр("РеквизитыКонтроляСтоимостиАктивов", 				РеквизитыКонтроля.СтоимостиАктивов);
		Запрос.УстановитьПараметр("РеквизитыКонтроляСтоимостиПереоценки", 			РеквизитыКонтроля.СтоимостиПереоценки);
		Запрос.УстановитьПараметр("РеквизитыКонтроляСтоимостиПрочихЦенныхБумаг", 	РеквизитыКонтроля.СтоимостиПрочихЦенныхБумаг);
		Запрос.УстановитьПараметр("РеквизитыКонтроляФинансовыеПоказатели", 			РеквизитыКонтроля.ФинансовыеПоказатели);
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтоимостиАктивов.ВидАктива КАК ВидАктива,
			|	СтоимостиАктивов.СубъектАналитики КАК СубъектАналитики,
			|	СтоимостиАктивов.Контрагент КАК Контрагент,
			|	СтоимостиАктивов.Основание КАК Основание,
			|	СтоимостиАктивов.ВидЗадолженности КАК ВидЗадолженности,
			|	СтоимостиАктивов.ВалютаСтроки КАК Валюта,
			|	СтоимостиАктивов.СуммаРынокВВалютеУчета КАК СуммаРынокВВалютеУчета,
			|	СтоимостиАктивов.СуммаРезерваВВалютеУчета КАК СуммаРезерваВВалютеУчета
			|ПОМЕСТИТЬ _СтоимостьАктивовНеЦБПоДаннымУчета
			|ИЗ
			|	&РеквизитыКонтроляСтоимостиАктивов КАК СтоимостиАктивов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РеквизитыКонтроляСтоимостиПереоценки.Рынок КАК Рынок,
			|	РеквизитыКонтроляСтоимостиПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
			|	РеквизитыКонтроляСтоимостиПереоценки.Партия КАК Партия,
			|	РеквизитыКонтроляСтоимостиПереоценки.СтрокаПартии КАК СтрокаПартии,
			|	РеквизитыКонтроляСтоимостиПереоценки.Цена КАК Цена,
			|	РеквизитыКонтроляСтоимостиПереоценки.ЦенаКупона КАК ЦенаКупона,
			|	РеквизитыКонтроляСтоимостиПереоценки.СуммаВВалютеУчета КАК СуммаВВалютеУчета,
			|	РеквизитыКонтроляСтоимостиПереоценки.СуммаКупонаВВалютеУчета КАК СуммаКупонаВВалютеУчета,
			|	РеквизитыКонтроляСтоимостиПереоценки.ВидЦены КАК ВидЦены,
			|	РеквизитыКонтроляСтоимостиПереоценки.УровеньОценки КАК УровеньОценки,
			|	РеквизитыКонтроляСтоимостиПереоценки.ДатаЦены КАК ДатаЦены,
			|	РеквизитыКонтроляСтоимостиПереоценки.Источник КАК Источник
			|ПОМЕСТИТЬ _СтоимостьПереоценкиПоДаннымУчета
			|ИЗ
			|	&РеквизитыКонтроляСтоимостиПереоценки КАК РеквизитыКонтроляСтоимостиПереоценки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РеквизитыКонтроляСтоимостиПрочихЦенныхБумаг.Рынок КАК Рынок,
			|	РеквизитыКонтроляСтоимостиПрочихЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
			|	РеквизитыКонтроляСтоимостиПрочихЦенныхБумаг.Партия КАК Партия,
			|	РеквизитыКонтроляСтоимостиПрочихЦенныхБумаг.СтрокаПартии КАК СтрокаПартии,
			|	РеквизитыКонтроляСтоимостиПрочихЦенныхБумаг.Цена КАК Цена,
			|	РеквизитыКонтроляСтоимостиПрочихЦенныхБумаг.ЦенаКупона КАК ЦенаКупона,
			|	РеквизитыКонтроляСтоимостиПрочихЦенныхБумаг.ВидЦены КАК ВидЦены,
			|	РеквизитыКонтроляСтоимостиПрочихЦенныхБумаг.УровеньОценки КАК УровеньОценки,
			|	РеквизитыКонтроляСтоимостиПрочихЦенныхБумаг.ДатаЦены КАК ДатаЦены,
			|	РеквизитыКонтроляСтоимостиПрочихЦенныхБумаг.Источник КАК Источник
			|ПОМЕСТИТЬ _СтоимостьПрочихЦенныхБумагПоДаннымУчета
			|ИЗ
			|	&РеквизитыКонтроляСтоимостиПрочихЦенныхБумаг КАК РеквизитыКонтроляСтоимостиПрочихЦенныхБумаг
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ФинансовыеПоказатели.ВидПоказателя КАК ВидПоказателя,
			|	ФинансовыеПоказатели.Значение КАК Значение,
			|	ФинансовыеПоказатели.РучнойВвод КАК РучнойВвод
			|ПОМЕСТИТЬ _ФинансовыеПоказателиПоДаннымУчета
			|ИЗ
			|	&РеквизитыКонтроляФинансовыеПоказатели КАК ФинансовыеПоказатели
			|ГДЕ
			|	ФинансовыеПоказатели.ВидПоказателя В (ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок), ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.РыночнаяСтоимостьАктивов), ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьПая))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ФинансовыеПоказатели.ВидПоказателя КАК ВидПоказателя,
			|	ФинансовыеПоказатели.Значение КАК Значение
			|ПОМЕСТИТЬ _ФинансовыеПоказателиДоходностиПоДаннымУчета
			|ИЗ
			|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
			|ГДЕ
			|	ФинансовыеПоказатели.Период = &Период
			|	И ФинансовыеПоказатели.Организация = &Организация
			|	И ФинансовыеПоказатели.СубъектАналитики = &СчетДоверительногоУправления
			|	И ВЫРАЗИТЬ(ФинансовыеПоказатели.СубъектАналитики КАК Справочник.СчетаДоверительногоУправления).ВидДоговораДоверительногоУправления <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
			|	И НЕ ФинансовыеПоказатели.ВидПоказателя В (ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок), ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.РыночнаяСтоимостьАктивов), ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьПая))";			
		#КонецОбласти 
	
	КонецЕсли; 
	
	Запрос.Текст = Запрос.Текст +"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|"
		+
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьАктивов.ВидАктива КАК ВидАктива,
		|	СтоимостьАктивов.СубъектАналитики КАК СубъектАналитики,
		|	СтоимостьАктивов.Контрагент КАК Контрагент,
		|	СтоимостьАктивов.Основание КАК Основание,
		|	СтоимостьАктивов.ВидЗадолженности КАК ВидЗадолженности,
		|	СтоимостьАктивов.ВалютаСтроки КАК Валюта,
		|	СтоимостьАктивов.СуммаРынокВВалютеУчета КАК СуммаРынокВВалютеУчета,
		|	СтоимостьАктивов.СуммаРезерваВВалютеУчета КАК СуммаРезерваВВалютеУчета
		|ПОМЕСТИТЬ _СтоимостьАктивовНеЦБ
		|ИЗ
		|	&СтоимостиАктивов КАК СтоимостьАктивов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьПереоценки.Рынок КАК Рынок,
		|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СтоимостьПереоценки.Партия КАК Партия,
		|	СтоимостьПереоценки.СтрокаПартии КАК СтрокаПартии,
		|	СтоимостьПереоценки.Цена КАК Цена,
		|	СтоимостьПереоценки.ЦенаКупона КАК ЦенаКупона,
		|	СтоимостьПереоценки.СуммаВВалютеУчета КАК СуммаВВалютеУчета,
		|	СтоимостьПереоценки.СуммаКупонаВВалютеУчета КАК СуммаКупонаВВалютеУчета,
		|	СтоимостьПереоценки.ВидЦены КАК ВидЦены,
		|	СтоимостьПереоценки.УровеньОценки КАК УровеньОценки,
		|	СтоимостьПереоценки.ДатаЦены КАК ДатаЦены,
		|	СтоимостьПереоценки.Источник КАК Источник
		|ПОМЕСТИТЬ _СтоимостьПереоценки
		|ИЗ
		|	&СтоимостиПереоценки КАК СтоимостьПереоценки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьПрочихЦенныхБумаг.Рынок КАК Рынок,
		|	СтоимостьПрочихЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СтоимостьПрочихЦенныхБумаг.Партия КАК Партия,
		|	СтоимостьПрочихЦенныхБумаг.СтрокаПартии КАК СтрокаПартии,
		|	СтоимостьПрочихЦенныхБумаг.Цена КАК Цена,
		|	СтоимостьПрочихЦенныхБумаг.ЦенаКупона КАК ЦенаКупона,
		|	СтоимостьПрочихЦенныхБумаг.ВидЦены КАК ВидЦены,
		|	СтоимостьПрочихЦенныхБумаг.УровеньОценки КАК УровеньОценки,
		|	СтоимостьПрочихЦенныхБумаг.ДатаЦены КАК ДатаЦены,
		|	СтоимостьПрочихЦенныхБумаг.Источник КАК Источник
		|ПОМЕСТИТЬ _СтоимостьПрочихЦенныхБумаг
		|ИЗ
		|	&СтоимостиПрочихЦенныхБумаг КАК СтоимостьПрочихЦенныхБумаг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФинансовыеПоказателиДоходности.ВидПоказателя КАК ВидПоказателя,
		|	ФинансовыеПоказателиДоходности.Значение КАК Значение
		|ПОМЕСТИТЬ _ФинансовыеПоказателиДоходности
		|ИЗ
		|	&ФинансовыеПоказателиДоходности КАК ФинансовыеПоказателиДоходности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&СЧА_Расчетная КАК СЧА_Расчетная,
		|	&РСА_Расчетная КАК РСА_Расчетная,
		|	&СтоимостьПая_Расчетная КАК СтоимостьПая_Расчетная,
		|	0 КАК СЧА_Текущая,
		|	0 КАК РСА_Текущая,
		|	0 КАК СтоимостьПая_Текущая,
		|	ЛОЖЬ КАК РучнойВвод
		|ПОМЕСТИТЬ _Итоги
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)
		|			ТОГДА ФинансовыеПоказатели.Значение
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.РыночнаяСтоимостьАктивов)
		|			ТОГДА ФинансовыеПоказатели.Значение
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьПая)
		|			ТОГДА ФинансовыеПоказатели.Значение
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ФинансовыеПоказатели.РучнойВвод
		|ИЗ
		|	_ФинансовыеПоказателиПоДаннымУчета КАК ФинансовыеПоказатели
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(СтоимостьАктивовСтарая.ВидАктива, СтоимостьАктивовНовая.ВидАктива) КАК ВидАктива,
		|	ЕСТЬNULL(СтоимостьАктивовСтарая.СубъектАналитики, СтоимостьАктивовНовая.СубъектАналитики) КАК СубъектАналитики,
		|	ЕСТЬNULL(СтоимостьАктивовСтарая.Контрагент, СтоимостьАктивовНовая.Контрагент) КАК Контрагент,
		|	ЕСТЬNULL(СтоимостьАктивовСтарая.Основание, СтоимостьАктивовНовая.Основание) КАК Основание,
		|	ЕСТЬNULL(СтоимостьАктивовСтарая.ВидЗадолженности, СтоимостьАктивовНовая.ВидЗадолженности) КАК ВидЗадолженности,
		|	ЕСТЬNULL(СтоимостьАктивовСтарая.Валюта, СтоимостьАктивовНовая.Валюта) КАК Валюта,
		|	ЕСТЬNULL(СтоимостьАктивовНовая.СуммаРынокВВалютеУчета, 0) КАК СуммаРынокВВалютеУчетаНовая,
		|	ЕСТЬNULL(СтоимостьАктивовСтарая.СуммаРынокВВалютеУчета, 0) КАК СуммаРынокВВалютеУчетаСтарая,
		|	ЕСТЬNULL(СтоимостьАктивовНовая.СуммаРезерваВВалютеУчета, 0) КАК СуммаРезерваВВалютеУчетаНовая,
		|	ЕСТЬNULL(СтоимостьАктивовСтарая.СуммаРезерваВВалютеУчета, 0) КАК СуммаРезерваВВалютеУчетаСтарая
		|ИЗ
		|	_СтоимостьАктивовНеЦБПоДаннымУчета КАК СтоимостьАктивовСтарая
		|		ПОЛНОЕ СОЕДИНЕНИЕ _СтоимостьАктивовНеЦБ КАК СтоимостьАктивовНовая
		|		ПО СтоимостьАктивовСтарая.ВидАктива = СтоимостьАктивовНовая.ВидАктива
		|			И СтоимостьАктивовСтарая.СубъектАналитики = СтоимостьАктивовНовая.СубъектАналитики
		|			И СтоимостьАктивовСтарая.Контрагент = СтоимостьАктивовНовая.Контрагент
		|			И СтоимостьАктивовСтарая.Основание = СтоимостьАктивовНовая.Основание
		|			И СтоимостьАктивовСтарая.ВидЗадолженности = СтоимостьАктивовНовая.ВидЗадолженности
		|			И СтоимостьАктивовСтарая.Валюта = СтоимостьАктивовНовая.Валюта
		|ГДЕ
		|	ЕСТЬNULL(СтоимостьАктивовНовая.СуммаРынокВВалютеУчета, 0) <> ЕСТЬNULL(СтоимостьАктивовСтарая.СуммаРынокВВалютеУчета, 0)
		|		ИЛИ ЕСТЬNULL(СтоимостьАктивовНовая.СуммаРезерваВВалютеУчета, 0) <> ЕСТЬNULL(СтоимостьАктивовСтарая.СуммаРезерваВВалютеУчета, 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(СтоимостьПереоценкиСтарая.Рынок, СтоимостьПереоценкиНовая.Рынок) КАК Рынок,
		|	ЕСТЬNULL(СтоимостьПереоценкиСтарая.ЦеннаяБумага, СтоимостьПереоценкиНовая.ЦеннаяБумага) КАК ЦеннаяБумага,
		|	ЕСТЬNULL(СтоимостьПереоценкиСтарая.Партия, СтоимостьПереоценкиНовая.Партия) КАК Партия,
		|	ЕСТЬNULL(СтоимостьПереоценкиСтарая.СтрокаПартии, СтоимостьПереоценкиНовая.СтрокаПартии) КАК СтрокаПартии,
		|	ЕСТЬNULL(СтоимостьПереоценкиСтарая.Цена, 0) КАК ЦенаСтарая,
		|	ЕСТЬNULL(СтоимостьПереоценкиНовая.Цена, 0) КАК ЦенаНовая,
		|	ЕСТЬNULL(СтоимостьПереоценкиСтарая.ЦенаКупона, 0) КАК ЦенаКупонаСтарая,
		|	ЕСТЬNULL(СтоимостьПереоценкиНовая.ЦенаКупона, 0) КАК ЦенаКупонаНовая,
		|	ЕСТЬNULL(СтоимостьПереоценкиСтарая.СуммаВВалютеУчета, 0) КАК СуммаВВалютеУчетаСтарая,
		|	ЕСТЬNULL(СтоимостьПереоценкиНовая.СуммаВВалютеУчета, 0) КАК СуммаВВалютеУчетаНовая,
		|	ЕСТЬNULL(СтоимостьПереоценкиСтарая.СуммаКупонаВВалютеУчета, 0) КАК СуммаКупонаВВалютеУчетаСтарая,
		|	ЕСТЬNULL(СтоимостьПереоценкиНовая.СуммаКупонаВВалютеУчета, 0) КАК СуммаКупонаВВалютеУчетаНовая,
		|	ЕСТЬNULL(СтоимостьПереоценкиСтарая.ВидЦены, НЕОПРЕДЕЛЕНО) КАК ВидЦеныСтарый,
		|	ЕСТЬNULL(СтоимостьПереоценкиНовая.ВидЦены, НЕОПРЕДЕЛЕНО) КАК ВидЦеныНовый,
		|	ЕСТЬNULL(СтоимостьПереоценкиСтарая.УровеньОценки, НЕОПРЕДЕЛЕНО) КАК УровеньОценкиСтарый,
		|	ЕСТЬNULL(СтоимостьПереоценкиНовая.УровеньОценки, НЕОПРЕДЕЛЕНО) КАК УровеньОценкиНовый,
		|	ЕСТЬNULL(СтоимостьПереоценкиСтарая.ДатаЦены, НЕОПРЕДЕЛЕНО) КАК ДатаЦеныСтарая,
		|	ЕСТЬNULL(СтоимостьПереоценкиНовая.ДатаЦены, НЕОПРЕДЕЛЕНО) КАК ДатаЦеныНовая,
		|	ЕСТЬNULL(СтоимостьПереоценкиСтарая.Источник, НЕОПРЕДЕЛЕНО) КАК ИсточникСтарый,
		|	ЕСТЬNULL(СтоимостьПереоценкиНовая.Источник, НЕОПРЕДЕЛЕНО) КАК ИсточникНовый
		|ИЗ
		|	_СтоимостьПереоценкиПоДаннымУчета КАК СтоимостьПереоценкиСтарая
		|		ПОЛНОЕ СОЕДИНЕНИЕ _СтоимостьПереоценки КАК СтоимостьПереоценкиНовая
		|		ПО СтоимостьПереоценкиСтарая.Рынок = СтоимостьПереоценкиНовая.Рынок
		|			И СтоимостьПереоценкиСтарая.ЦеннаяБумага = СтоимостьПереоценкиНовая.ЦеннаяБумага
		|			И СтоимостьПереоценкиСтарая.Партия = СтоимостьПереоценкиНовая.Партия
		|			И СтоимостьПереоценкиСтарая.СтрокаПартии = СтоимостьПереоценкиНовая.СтрокаПартии
		|ГДЕ
		|	(ЕСТЬNULL(СтоимостьПереоценкиСтарая.СуммаВВалютеУчета, 0) <> ЕСТЬNULL(СтоимостьПереоценкиНовая.СуммаВВалютеУчета, 0)
		|			ИЛИ ЕСТЬNULL(СтоимостьПереоценкиСтарая.СуммаКупонаВВалютеУчета, 0) <> ЕСТЬNULL(СтоимостьПереоценкиНовая.СуммаКупонаВВалютеУчета, 0)
		|			ИЛИ ЕСТЬNULL(СтоимостьПереоценкиСтарая.ВидЦены, 0) <> ЕСТЬNULL(СтоимостьПереоценкиНовая.ВидЦены, 0)
		|			ИЛИ ЕСТЬNULL(СтоимостьПереоценкиСтарая.УровеньОценки, 0) <> ЕСТЬNULL(СтоимостьПереоценкиНовая.УровеньОценки, 0)
		|			ИЛИ ЕСТЬNULL(СтоимостьПереоценкиСтарая.ДатаЦены, 0) <> ЕСТЬNULL(СтоимостьПереоценкиНовая.ДатаЦены, 0)
		|			ИЛИ ЕСТЬNULL(СтоимостьПереоценкиСтарая.Источник, 0) <> ЕСТЬNULL(СтоимостьПереоценкиНовая.Источник, 0))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(СтоимостьПереоценкиСтарая.Рынок, СтоимостьПереоценкиНовая.Рынок) КАК Рынок,
		|	ЕСТЬNULL(СтоимостьПереоценкиСтарая.ЦеннаяБумага, СтоимостьПереоценкиНовая.ЦеннаяБумага) КАК ЦеннаяБумага,
		|	ЕСТЬNULL(СтоимостьПереоценкиСтарая.Партия, СтоимостьПереоценкиНовая.Партия) КАК Партия,
		|	ЕСТЬNULL(СтоимостьПереоценкиСтарая.СтрокаПартии, СтоимостьПереоценкиНовая.СтрокаПартии) КАК СтрокаПартии,
		|	ЕСТЬNULL(СтоимостьПереоценкиСтарая.Цена, 0) КАК ЦенаСтарая,
		|	ЕСТЬNULL(СтоимостьПереоценкиНовая.Цена, 0) КАК ЦенаНовая,
		|	ЕСТЬNULL(СтоимостьПереоценкиСтарая.ЦенаКупона, 0) КАК ЦенаКупонаСтарая,
		|	ЕСТЬNULL(СтоимостьПереоценкиНовая.ЦенаКупона, 0) КАК ЦенаКупонаНовая,
		|	ЕСТЬNULL(СтоимостьПереоценкиСтарая.ВидЦены, НЕОПРЕДЕЛЕНО) КАК ВидЦеныСтарый,
		|	ЕСТЬNULL(СтоимостьПереоценкиНовая.ВидЦены, НЕОПРЕДЕЛЕНО) КАК ВидЦеныНовый,
		|	ЕСТЬNULL(СтоимостьПереоценкиСтарая.УровеньОценки, НЕОПРЕДЕЛЕНО) КАК УровеньОценкиСтарый,
		|	ЕСТЬNULL(СтоимостьПереоценкиНовая.УровеньОценки, НЕОПРЕДЕЛЕНО) КАК УровеньОценкиНовый,
		|	ЕСТЬNULL(СтоимостьПереоценкиСтарая.ДатаЦены, НЕОПРЕДЕЛЕНО) КАК ДатаЦеныСтарая,
		|	ЕСТЬNULL(СтоимостьПереоценкиНовая.ДатаЦены, НЕОПРЕДЕЛЕНО) КАК ДатаЦеныНовая,
		|	ЕСТЬNULL(СтоимостьПереоценкиСтарая.Источник, НЕОПРЕДЕЛЕНО) КАК ИсточникСтарый,
		|	ЕСТЬNULL(СтоимостьПереоценкиНовая.Источник, НЕОПРЕДЕЛЕНО) КАК ИсточникНовый
		|ИЗ
		|	_СтоимостьПрочихЦенныхБумагПоДаннымУчета КАК СтоимостьПереоценкиСтарая
		|		ПОЛНОЕ СОЕДИНЕНИЕ _СтоимостьПрочихЦенныхБумаг КАК СтоимостьПереоценкиНовая
		|		ПО СтоимостьПереоценкиСтарая.Рынок = СтоимостьПереоценкиНовая.Рынок
		|			И СтоимостьПереоценкиСтарая.ЦеннаяБумага = СтоимостьПереоценкиНовая.ЦеннаяБумага
		|			И СтоимостьПереоценкиСтарая.Партия = СтоимостьПереоценкиНовая.Партия
		|			И СтоимостьПереоценкиСтарая.СтрокаПартии = СтоимостьПереоценкиНовая.СтрокаПартии
		|ГДЕ
		|	(ЕСТЬNULL(СтоимостьПереоценкиСтарая.Цена, 0) <> ЕСТЬNULL(СтоимостьПереоценкиНовая.Цена, 0)
		|			ИЛИ ЕСТЬNULL(СтоимостьПереоценкиСтарая.ЦенаКупона, 0) <> ЕСТЬNULL(СтоимостьПереоценкиНовая.ЦенаКупона, 0)
		|			ИЛИ ЕСТЬNULL(СтоимостьПереоценкиСтарая.ВидЦены, 0) <> ЕСТЬNULL(СтоимостьПереоценкиНовая.ВидЦены, 0)
		|			ИЛИ ЕСТЬNULL(СтоимостьПереоценкиСтарая.УровеньОценки, 0) <> ЕСТЬNULL(СтоимостьПереоценкиНовая.УровеньОценки, 0)
		|			ИЛИ ЕСТЬNULL(СтоимостьПереоценкиСтарая.ДатаЦены, 0) <> ЕСТЬNULL(СтоимостьПереоценкиНовая.ДатаЦены, 0)
		|			ИЛИ ЕСТЬNULL(СтоимостьПереоценкиСтарая.Источник, 0) <> ЕСТЬNULL(СтоимостьПереоценкиНовая.Источник, 0))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ФинансовыеПоказателиДоходностиСтарые.ВидПоказателя, ФинансовыеПоказателиДоходностиНовые.ВидПоказателя) КАК ВидПоказателя,
		|	ЕСТЬNULL(ФинансовыеПоказателиДоходностиСтарые.Значение, 0) КАК ЗначениеСтарое,
		|	ЕСТЬNULL(ФинансовыеПоказателиДоходностиНовые.Значение, 0) КАК ЗначениеНовое
		|ИЗ
		|	_ФинансовыеПоказателиДоходностиПоДаннымУчета КАК ФинансовыеПоказателиДоходностиСтарые
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ФинансовыеПоказателиДоходности КАК ФинансовыеПоказателиДоходностиНовые
		|		ПО ФинансовыеПоказателиДоходностиСтарые.ВидПоказателя = ФинансовыеПоказателиДоходностиНовые.ВидПоказателя
		|ГДЕ
		|	ЕСТЬNULL(ФинансовыеПоказателиДоходностиСтарые.Значение, 0) <> ЕСТЬNULL(ФинансовыеПоказателиДоходностиНовые.Значение, 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(_Итоги.РСА_Расчетная) КАК РСА_Расчетная,
		|	СУММА(_Итоги.СЧА_Расчетная) КАК СЧА_Расчетная,
		|	СУММА(_Итоги.РСА_Текущая) КАК РСА_Текущая,
		|	СУММА(_Итоги.СЧА_Текущая) КАК СЧА_Текущая,
		|	СУММА(_Итоги.СтоимостьПая_Расчетная) КАК СтоимостьПая_Расчетная,
		|	СУММА(_Итоги.СтоимостьПая_Текущая) КАК СтоимостьПая_Текущая,
		|	МАКСИМУМ(_Итоги.РучнойВвод) КАК РучнойВвод
		|ИЗ
		|	_Итоги КАК _Итоги";
	
	// Костыль (начало)
	Если ДанныеДокумента.Период < '20180709' Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЕСТЬNULL(СтоимостьПереоценкиСтарая.Источник, 0) <> ЕСТЬNULL(СтоимостьПереоценкиНовая.Источник, 0)", 
			"ВЫБОР
			|	КОГДА СтоимостьПереоценкиСтарая.Источник = ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
			|			И СтоимостьПереоценкиСтарая.ВидЦены = ЗНАЧЕНИЕ(Перечисление.ИсточникиЦеныДляПереоценки.СправедливаяЦенаНРД)
			|		ТОГДА СтоимостьПереоценкиНовая.Источник ЕСТЬ NULL
			|	ИНАЧЕ ЕСТЬNULL(СтоимостьПереоценкиСтарая.Источник, 0) <> ЕСТЬNULL(СтоимостьПереоценкиНовая.Источник, 0)
			|КОНЕЦ");
	КонецЕсли;
	// Костыль (конец)
	
	#КонецОбласти 
	
	РезультатЗапроса 		= Запрос.ВыполнитьПакет();
	ОтличияАктивов 			= РезультатЗапроса[РезультатЗапроса.ВГраница()-4].Выгрузить();
	ОтличияЦБ 				= РезультатЗапроса[РезультатЗапроса.ВГраница()-3].Выгрузить();
	ОтличияПрочихЦБ 		= РезультатЗапроса[РезультатЗапроса.ВГраница()-2].Выгрузить();
	ОтличияДоходности		= РезультатЗапроса[РезультатЗапроса.ВГраница()-1].Выгрузить();
	Итоги 					= РезультатЗапроса[РезультатЗапроса.ВГраница()].Выгрузить();
	
	ЕстьОшибкиЗарегистрированныхЗначений = Ложь;
	РучнойВвод = Ложь;
	ЗначенияИтогов = Неопределено;
	
	Если Итоги.Количество() > 0 Тогда
		СтрокаИтоги = Итоги[0];
		ЕстьОшибкиЗарегистрированныхЗначений = (СтрокаИтоги.РСА_Текущая <> СтрокаИтоги.РСА_Расчетная) 
												Или (СтрокаИтоги.СЧА_Текущая <> СтрокаИтоги.СЧА_Расчетная) 
												Или (СтрокаИтоги.СтоимостьПая_Текущая <> СтрокаИтоги.СтоимостьПая_Расчетная)
												ИЛИ ОтличияДоходности.Количество() > 0;
		РучнойВвод = СтрокаИтоги.РучнойВвод;
	КонецЕсли; 
	
	Результат.Вставить("ЕстьОшибкиЗарегистрированныхЗначений", 	ЕстьОшибкиЗарегистрированныхЗначений);
	Результат.Вставить("ОтличияАктивов", 		ОтличияАктивов);
	Результат.Вставить("ОтличияЦБ",				ОтличияЦБ);
	Результат.Вставить("ОтличияПрочихЦБ",		ОтличияПрочихЦБ);
	Результат.Вставить("ОтличияДоходности",		ОтличияДоходности);
	Результат.Вставить("РучнойВвод", 			РучнойВвод);
	Результат.Вставить("Итоги", 				Итоги);
	
КонецПроцедуры

Функция СформироватьТабличныйДокумент(НаборыДанных) Экспорт

	ТабличныйДокумент = Новый ТабличныйДокумент;
	СКД = ПолучитьМакет("Макет");
	
	Если НаборыДанных.Свойство("Клиенты") Тогда
		ВыводитьКлиентов			= Истина;
		ВыводитьОтличияЦБ			= Ложь;
		ВыводитьОтличияПрочихЦБ 	= Ложь;
		ВыводитьОтличияАктивов		= Ложь;
		ВыводитьОтличияДоходности	= Ложь;
		ВыводитьИтоги				= Ложь;
		ВыводитьИтогиПИФ			= Ложь;
	Иначе	
		Если Не (НаборыДанных.Свойство("ОтличияЦБ") И НаборыДанных.Свойство("ОтличияПрочихЦБ") 
			И НаборыДанных.Свойство("ОтличияАктивов") И НаборыДанных.Свойство("ЕстьОшибкиЗарегистрированныхЗначений")) Тогда
			Возврат Неопределено;
		КонецЕсли; 
		ВыводитьКлиентов			= Ложь;
		ВыводитьОтличияЦБ			= (НаборыДанных.ОтличияЦБ.Количество() > 0);
		ВыводитьОтличияПрочихЦБ		= (НаборыДанных.ОтличияПрочихЦБ.Количество() > 0);
		ВыводитьОтличияАктивов		= (НаборыДанных.ОтличияАктивов.Количество() > 0);
		ВыводитьОтличияДоходности	= (НаборыДанных.Свойство("ОтличияДоходности") И НаборыДанных.ОтличияДоходности.Количество() > 0);
		Если НаборыДанных.ЕстьОшибкиЗарегистрированныхЗначений Тогда
			ВыводитьИтоги		= НаборыДанных.ВидДоговора <> Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда;
			ВыводитьИтогиПИФ	= Не ВыводитьИтоги;
		Иначе
			ВыводитьИтоги		= Ложь;
			ВыводитьИтогиПИФ	= Ложь;
		КонецЕсли; 
		
	КонецЕсли;
	
	Настройки = СКД.НастройкиПоУмолчанию;
	
	Для Каждого ЭлементСтруктуры Из Настройки.Структура Цикл
		Если ЭлементСтруктуры.Имя = "Рынок" Тогда
			ЭлементСтруктуры.Использование = ВыводитьОтличияЦБ;
		ИначеЕсли ЭлементСтруктуры.Имя = "РынокПрочие" Тогда
			ЭлементСтруктуры.Использование = ВыводитьОтличияПрочихЦБ;	
		ИначеЕсли ЭлементСтруктуры.Имя = "Активы" Тогда
			ЭлементСтруктуры.Использование = ВыводитьОтличияАктивов;
		ИначеЕсли ЭлементСтруктуры.Имя = "Итоги" Тогда
			ЭлементСтруктуры.Использование = ВыводитьИтоги;
		ИначеЕсли ЭлементСтруктуры.Имя = "ИтогиПИФ" Тогда
			ЭлементСтруктуры.Использование = ВыводитьИтогиПИФ;
		ИначеЕсли ЭлементСтруктуры.Имя = "ОтличияДоходности" Тогда
			ЭлементСтруктуры.Использование = ВыводитьОтличияДоходности;
		ИначеЕсли ЭлементСтруктуры.Имя = "Клиенты" Тогда
			ЭлементСтруктуры.Использование = ВыводитьКлиентов;
			
			// Дата \ НаборДанных  
			Для Каждого ЭлементПодструктуры Из ЭлементСтруктуры.Структура[0].Структура Цикл
				Если ЭлементПодструктуры.Имя = "КлиентыРынокЗаголовок" Тогда
					ЭлементПодструктуры.Использование = НаборыДанных.Свойство("ОтличияЦБ");
				ИначеЕсли ЭлементПодструктуры.Имя = "КлиентыРынок" Тогда
					ЭлементПодструктуры.Использование = НаборыДанных.Свойство("ОтличияЦБ");
				ИначеЕсли ЭлементПодструктуры.Имя = "КлиентыРынокПрочиеЗаголовок" Тогда
					ЭлементПодструктуры.Использование = НаборыДанных.Свойство("ОтличияПрочихЦБ");
				ИначеЕсли ЭлементПодструктуры.Имя = "КлиентыРынокПрочие" Тогда
					ЭлементПодструктуры.Использование = НаборыДанных.Свойство("ОтличияПрочихЦБ");
				ИначеЕсли ЭлементПодструктуры.Имя = "КлиентыАктивыЗаголовок" Тогда
					ЭлементПодструктуры.Использование = НаборыДанных.Свойство("ОтличияАктивов");
				ИначеЕсли ЭлементПодструктуры.Имя = "КлиентыАктивы" Тогда
					ЭлементПодструктуры.Использование = НаборыДанных.Свойство("ОтличияАктивов");
				ИначеЕсли ЭлементПодструктуры.Имя = "КлиентыДоходностьЗаголовок" Тогда
					ЭлементПодструктуры.Использование = НаборыДанных.Свойство("ОтличияДоходности");
				ИначеЕсли ЭлементПодструктуры.Имя = "КлиентыДоходность" Тогда
					ЭлементПодструктуры.Использование = НаборыДанных.Свойство("ОтличияДоходности");
				КонецЕсли;		
			КонецЦикла;
		КонецЕсли; 
	КонецЦикла; 

	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, СКД.НастройкиПоУмолчанию);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, НаборыДанных, ДанныеРасшифровки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабличныйДокумент);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);

	ТабличныйДокумент.ФиксацияСверху = 0;	
	
	ТабличныйДокумент.ПоказатьУровеньГруппировокСтрок(1);
	
	Возврат ТабличныйДокумент;

КонецФункции 

Функция СформироватьСтруктуруПараметровРасчета(СчетДоверительногоУправления, Период)

	ПараметрыРасчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчетДоверительногоУправления, "Организация, ВидДоговораДоверительногоУправления");
	
	ПараметрыРасчета.Вставить("Период",							НачалоДня(Период));
	ПараметрыРасчета.Вставить("Дата",							КонецДня(Период));
	ПараметрыРасчета.Вставить("СчетДоверительногоУправления",	СчетДоверительногоУправления);
	ПараметрыРасчета.Вставить("ЦельРасчета",					Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении);
	ПараметрыРасчета.Вставить("ВалютаУчета",					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыРасчета.Организация, "ВалютаУчета"));
	ПараметрыРасчета.Вставить("ВалютаРубли",					ПараметрыРасчета.ВалютаУчета);
	
	// Проверяем, что заведены настройки оценки, и подгружаем файл с оценочной стоимостью, предоставленной клиентом
	
	НастройкиОценки				= РаботаСПереоценкой.ОпределитьНастройкиОценки(ПараметрыРасчета.Дата, ПараметрыРасчета.Организация, СчетДоверительногоУправления, ПараметрыРасчета.ЦельРасчета, Истина);
	ВыполнятьРасчетПоУказаниюЦБ	= НастройкиОценки.ВыполнятьРасчетПоУказаниюЦБ5419 ИЛИ НастройкиОценки.ВыполнятьРасчетПоПисьмуЦБ0185316;
	АдресТаблицыСтоимостей		= Неопределено;
	
	Если Не ЗначениеЗаполнено(НастройкиОценки.ВариантРасчетаОценочнойСтоимости) Тогда
		
		Возврат "Не определен вариант оценки для цели '" + ПараметрыРасчета.ЦельРасчета + "'";
		
	ИначеЕсли НастройкиОценки.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.ПредоставленаКлиентом Тогда
		
		Отказ		= Ложь;
		ТекстОшибки	= Неопределено;
		
		АдресТаблицыСтоимостей = РаботаСВнешнимиСистемамиКлиентСервер.ПоместитьФайлОценочнойСтоимостиПредоставленнойКлиентомВоВременноеХранилище(
			СчетДоверительногоУправления, Период, Ложь, Новый УникальныйИдентификатор, Отказ, Ложь, ТекстОшибки);

		Если Отказ И Не ВыполнятьРасчетПоУказаниюЦБ Тогда // Если оценка "заморожена", то актуальные цены от клиента не нужны
			Возврат ТекстОшибки;
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыРасчета.Вставить("ВариантРасчетаОценочнойСтоимости",	НастройкиОценки.ВариантРасчетаОценочнойСтоимости); 
	ПараметрыРасчета.Вставить("ВидУчета",							НастройкиОценки.ВидУчетаДляОстатковПартий);
	ПараметрыРасчета.Вставить("АдресТаблицыСтоимостей",				АдресТаблицыСтоимостей); 
	ПараметрыРасчета.Вставить("КонтрольСЧА");
	
	Возврат ПараметрыРасчета;

КонецФункции

Процедура ПроверитьКоличествоАктивныхЗаданий(Наименование, Ограничение, Таймаут)
	
	МассивРаботающихЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Наименование, Состояние", Наименование, СостояниеФоновогоЗадания.Активно));
	
	Пока МассивРаботающихЗаданий.Количество() >= Ограничение Цикл
				
		Для Индекс = -МассивРаботающихЗаданий.Количество()+1 По 0 Цикл
		
			ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(МассивРаботающихЗаданий[-Индекс].УникальныйИдентификатор);
			
			Попытка
				ФоновоеЗадание.ОжидатьЗавершения(Таймаут);
				Прервать;
			Исключение 
			КонецПопытки;
		
		КонецЦикла; 
		
		МассивРаботающихЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Наименование, Состояние", Наименование, СостояниеФоновогоЗадания.Активно));
		
	КонецЦикла;
	
КонецПроцедуры
 
Функция ПолучитьПараметрыВыполненияДляСбораСтатистики(ПараметрыОтчета)
	
	Описание = "";
	
	Для каждого Элемент Из ПараметрыОтчета Цикл
		Описание = Описание + Символы.ПС + Элемент.Ключ + ": " + Элемент.Значение;
	КонецЦикла; 
	
	Описание = Сред(Описание, 2);
	
	Хранилище = Новый ХранилищеЗначения(ПараметрыОтчета, Новый СжатиеДанных(9));
	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание", Хранилище, Описание);
	
	Возврат ПараметрыВыполненияДляСбораСтатистики;
	
КонецФункции

Функция ПолучитьТаблицуКонтроляСЧА(Организация, ПериодКонтроля, РежимОтбора, Отбор) Экспорт

	Перем ОтборВидыДоговоровДУ, ОтборСчетаДУ, ОтборКлиенты, АдресРезультатаОтбора, ИсключитьСчетНЕОПРЕДЕЛЕН;
	
	Отбор.Свойство("ОтборВидыДоговоровДУ",		ОтборВидыДоговоровДУ);
	Отбор.Свойство("ОтборСчетаДУ",				ОтборСчетаДУ);
	Отбор.Свойство("ОтборКлиенты",				ОтборКлиенты);
	Отбор.Свойство("АдресРезультатаОтбора",		АдресРезультатаОтбора);
	Отбор.Свойство("ИсключитьСчетНЕОПРЕДЕЛЕН",	ИсключитьСчетНЕОПРЕДЕЛЕН);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", 				Организация);
	Запрос.УстановитьПараметр("ДатаНачала", 				ПериодКонтроля.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 				ПериодКонтроля.ДатаОкончания);
	Запрос.УстановитьПараметр("ИсключитьСчетНЕОПРЕДЕЛЕН", 	?(ИсключитьСчетНЕОПРЕДЕЛЕН = Неопределено, Ложь, ИсключитьСчетНЕОПРЕДЕЛЕН));
	
	ПоместитьДатыДействияЗаПериодВоВременнуюТаблицу = Истина;
	ДополнитьДокументамиРассчитаннымиЗаПериод		= Истина;
	
	Если РежимОтбора < 3 Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СчетаДоверительногоУправления.Ссылка КАК Ссылка,
			|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
			|	СчетаДоверительногоУправления.Организация КАК Организация,
			|	СчетаДоверительногоУправления.ДатаРасторжения КАК ДатаРасторжения,
			|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления
			|ПОМЕСТИТЬ _СчетаДоверительногоУправления
			|ИЗ
			|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДоверительногоУправления
			|		ПО СчетаДоверительногоУправления.Ссылка = КлиентыДоверительногоУправления.СчетДоверительногоУправления
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИменованныеОбъекты КАК ИменованныеОбъекты
			|		ПО (&ИсключитьСчетНЕОПРЕДЕЛЕН)
			|			И СчетаДоверительногоУправления.Ссылка = ИменованныеОбъекты.Объект
			|			И (ИменованныеОбъекты.Имя ПОДОБНО ""СчетДУ_Неопределен_%"")
			|ГДЕ
			|	(&Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
			|			ИЛИ СчетаДоверительногоУправления.Организация = &Организация)
			|	И СчетаДоверительногоУправления.ДатаЗаключения <= &ДатаОкончания
			|	И (СчетаДоверительногоУправления.ДатаРасторжения >= &ДатаНачала
			|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))
			|	И ИменованныеОбъекты.Объект ЕСТЬ NULL
			|	И &ОтборПоВидамДоговоров
			|	И &ОтборПоСчетамДУ";
			
		Если РежимОтбора = 0 Тогда
			Запрос.УстановитьПараметр("ОтборПоВидамДоговоров", 	Истина);
			Запрос.УстановитьПараметр("ОтборПоСчетамДУ", 		Истина);
		ИначеЕсли РежимОтбора = 1 Тогда 	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоВидамДоговоров", "СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В (&ОтборПоВидамДоговоров)");
			Запрос.УстановитьПараметр("ОтборПоВидамДоговоров", 	ОтборВидыДоговоровДУ);
			Запрос.УстановитьПараметр("ОтборПоСчетамДУ", 		Истина);
		ИначеЕсли РежимОтбора = 2 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоСчетамДУ", "СчетаДоверительногоУправления.Ссылка В (&ОтборПоСчетамДУ)");
			Запрос.УстановитьПараметр("ОтборПоСчетамДУ", 		ОтборСчетаДУ);
			Запрос.УстановитьПараметр("ОтборПоВидамДоговоров", 	Истина);
		КонецЕсли; 
		
	ИначеЕсли РежимОтбора = 3 Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СчетаДоверительногоУправления.Ссылка КАК Ссылка,
			|	СчетаДоверительногоУправления.Наименование КАК Наименование,
			|	СчетаДоверительногоУправления.Организация КАК Организация,
			|	СчетаДоверительногоУправления.ДатаРасторжения КАК ДатаРасторжения,
			|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления
			|ПОМЕСТИТЬ _СчетаДоверительногоУправленияВрем
			|ИЗ
			|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДоверительногоУправления
			|		ПО СчетаДоверительногоУправления.Ссылка = КлиентыДоверительногоУправления.СчетДоверительногоУправления
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИменованныеОбъекты КАК ИменованныеОбъекты
			|		ПО (&ИсключитьСчетНЕОПРЕДЕЛЕН)
			|			И СчетаДоверительногоУправления.Ссылка = ИменованныеОбъекты.Объект
			|			И (ИменованныеОбъекты.Имя ПОДОБНО ""СчетДУ_Неопределен_%"")
			|ГДЕ
			|	(&Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
			|			ИЛИ СчетаДоверительногоУправления.Организация = &Организация)
			|	И СчетаДоверительногоУправления.ДатаЗаключения <= &ДатаОкончания
			|	И (СчетаДоверительногоУправления.ДатаРасторжения >= &ДатаНачала
			|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))
			|	И ИменованныеОбъекты.Объект ЕСТЬ NULL
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления
			|ПОМЕСТИТЬ _КлиентыДоверительногоУправления
			|ИЗ
			|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаНачала, ) КАК КлиентыДоверительногоУправленияСрезПоследних
			|ГДЕ
			|	КлиентыДоверительногоУправленияСрезПоследних.Клиент В(&ОтборПоКлиентам)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	КлиентыДоверительногоУправления.СчетДоверительногоУправления
			|ИЗ
			|	РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДоверительногоУправления
			|ГДЕ
			|	КлиентыДоверительногоУправления.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И КлиентыДоверительногоУправления.Клиент В(&ОтборПоКлиентам)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	_СчетаДоверительногоУправленияВрем.Ссылка КАК Ссылка,
			|	_СчетаДоверительногоУправленияВрем.Ссылка КАК СчетДоверительногоУправления,
			|	_СчетаДоверительногоУправленияВрем.Организация КАК Организация,
			|	_СчетаДоверительногоУправленияВрем.ДатаРасторжения КАК ДатаРасторжения,
			|	_СчетаДоверительногоУправленияВрем.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления
			|ПОМЕСТИТЬ _СчетаДоверительногоУправления
			|ИЗ
			|	_КлиентыДоверительногоУправления КАК _КлиентыДоверительногоУправления
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправленияВрем КАК _СчетаДоверительногоУправленияВрем
			|		ПО _КлиентыДоверительногоУправления.СчетДоверительногоУправления = _СчетаДоверительногоУправленияВрем.Ссылка";
			
		Запрос.УстановитьПараметр("ОтборПоКлиентам", ОтборКлиенты);
		
	ИначеЕсли РежимОтбора = 4 Тогда	

		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ДанныеОтбора.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ДанныеОтбора.Период КАК Период
			|ПОМЕСТИТЬ _ДанныеОтбора
			|ИЗ
			|	&ДанныеОтбора КАК ДанныеОтбора
			|ГДЕ
			|	ДанныеОтбора.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
			|	СчетаДоверительногоУправления.Организация КАК Организация,
			|	_ДанныеОтбора.Период КАК Дата
			|ПОМЕСТИТЬ _ДатыДействияЗаПериод
			|ИЗ
			|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеОтбора КАК _ДанныеОтбора
			|		ПО (_ДанныеОтбора.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка)
			|ГДЕ
			|	(&Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
			|			ИЛИ СчетаДоверительногоУправления.Организация = &Организация)
			|	И СчетаДоверительногоУправления.ДатаЗаключения <= _ДанныеОтбора.Период
			|	И (СчетаДоверительногоУправления.ДатаРасторжения >= _ДанныеОтбора.Период
			|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДатыДействияЗаПериод.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_ДатыДействияЗаПериод.Организация КАК Организация,
			|	МИНИМУМ(_ДатыДействияЗаПериод.Дата) КАК ДатаНачала,
			|	МАКСИМУМ(_ДатыДействияЗаПериод.Дата) КАК ДатаОкончания
			|ПОМЕСТИТЬ _ГраницыПериодовДоговоров
			|ИЗ
			|	_ДатыДействияЗаПериод КАК _ДатыДействияЗаПериод
			|
			|СГРУППИРОВАТЬ ПО
			|	_ДатыДействияЗаПериод.СчетДоверительногоУправления,
			|	_ДатыДействияЗаПериод.Организация
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НастройкиФормирования.Период КАК Период,
			|	НастройкиФормирования.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_ГраницыПериодовДоговоров.ДатаНачала КАК ДатаНачала,
			|	_ГраницыПериодовДоговоров.ДатаОкончания КАК ДатаОкончания
			|ПОМЕСТИТЬ _ВсеНастройки
			|ИЗ
			|	_ГраницыПериодовДоговоров КАК _ГраницыПериодовДоговоров
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиФормированияСЧА КАК НастройкиФормирования
			|		ПО _ГраницыПериодовДоговоров.СчетДоверительногоУправления = НастройкиФормирования.СчетДоверительногоУправления
			|			И (НастройкиФормирования.Период <= _ГраницыПериодовДоговоров.ДатаОкончания)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ВсеНастройки.Период КАК Период,
			|	_ВсеНастройки.СчетДоверительногоУправления КАК СчетДоверительногоУправления
			|ПОМЕСТИТЬ _ПериодичностьНастроекПоСчетамДУ
			|ИЗ
			|	_ВсеНастройки КАК _ВсеНастройки
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ВсеНастройки КАК _ВсеНастройки1
			|		ПО _ВсеНастройки.СчетДоверительногоУправления = _ВсеНастройки1.СчетДоверительногоУправления
			|			И _ВсеНастройки.Период < _ВсеНастройки1.Период
			|
			|СГРУППИРОВАТЬ ПО
			|	_ВсеНастройки.Период,
			|	_ВсеНастройки.СчетДоверительногоУправления,
			|	_ВсеНастройки.ДатаНачала,
			|	_ВсеНастройки.ДатаОкончания
			|
			|ИМЕЮЩИЕ
			|	ЕСТЬNULL(МИНИМУМ(_ВсеНастройки1.Период), _ВсеНастройки.ДатаОкончания) >= _ВсеНастройки.ДатаНачала"
			+ ";
			|";		
			
		Запрос.УстановитьПараметр("ДанныеОтбора", ПолучитьИзВременногоХранилища(АдресРезультатаОтбора));	
		
		ПоместитьДатыДействияЗаПериодВоВременнуюТаблицу = Ложь;
		ДополнитьДокументамиРассчитаннымиЗаПериод		= Ложь;
		
	КонецЕсли; 
	
	Запрос.Выполнить();
		
	Если ПоместитьДатыДействияЗаПериодВоВременнуюТаблицу Тогда
	
		Справочники.НастройкиРегламентныхДействий.ПоместитьДатыДействияЗаПериодВоВременнуюТаблицу(Запрос, Новый Структура("ВидДействия, ДатаС, ДатаПо, ДополнитьРабочимиДнями", "СЧА", Запрос.Параметры.ДатаНачала, Запрос.Параметры.ДатаОкончания, Истина)); 
		
	КонецЕсли;		
	
	#Область Текст_запроса
	
	Запрос.Текст = 
		"
		|////////////////////////////////////////////////////////////////////////////////
		|" + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(_ДатыРасчетаСЧА.Организация, ВложенныйЗапрос.Организация) КАК Организация,
		|	ЕСТЬNULL(_ДатыРасчетаСЧА.СчетДоверительногоУправления, ВложенныйЗапрос.СчетДоверительногоУправления) КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(_ДатыРасчетаСЧА.Дата, ВложенныйЗапрос.Дата) КАК Дата,
		|	_ДатыРасчетаСЧА.Дата ЕСТЬ НЕ NULL  КАК ДатаРасчетаСЧА,
		|	_ДатыРасчетаСЧА.Дата ЕСТЬ НЕ NULL 
		|		И ВложенныйЗапрос.Дата ЕСТЬ NULL КАК НеРассчитанаСЧА,
		|	ВложенныйЗапрос.РегистрацияСтоимостиАктивов КАК РегистрацияСтоимостиАктивов
		|ПОМЕСТИТЬ _Документы
		|ИЗ
		|	_ДатыДействияЗаПериод КАК _ДатыРасчетаСЧА
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			РегистрацияСтоимостиАктивов.Организация КАК Организация,
		|			РегистрацияСтоимостиАктивов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|			НАЧАЛОПЕРИОДА(РегистрацияСтоимостиАктивов.Дата, ДЕНЬ) КАК Дата,
		|			РегистрацияСтоимостиАктивов.Ссылка КАК РегистрацияСтоимостиАктивов
		|		ИЗ
		|			_ГраницыПериодовДоговоров КАК _ГраницыПериодов
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РегистрацияСтоимостиАктивов КАК РегистрацияСтоимостиАктивов
		|				ПО _ГраницыПериодов.Организация = РегистрацияСтоимостиАктивов.Организация
		|					И _ГраницыПериодов.СчетДоверительногоУправления = РегистрацияСтоимостиАктивов.СчетДоверительногоУправления
		|					И (РегистрацияСтоимостиАктивов.Проведен)
		|					И (НАЧАЛОПЕРИОДА(РегистрацияСтоимостиАктивов.Дата, ДЕНЬ) МЕЖДУ _ГраницыПериодов.ДатаНачала И _ГраницыПериодов.ДатаОкончания)) КАК ВложенныйЗапрос
		|		ПО _ДатыРасчетаСЧА.Организация = ВложенныйЗапрос.Организация
		|			И _ДатыРасчетаСЧА.СчетДоверительногоУправления = ВложенныйЗапрос.СчетДоверительногоУправления
		|			И _ДатыРасчетаСЧА.Дата = ВложенныйЗапрос.Дата
		|ГДЕ
		|	(&ДополнитьДокументамиРассчитаннымиЗаПериод
		|			ИЛИ _ДатыРасчетаСЧА.Дата ЕСТЬ НЕ NULL )
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(_ДатыРасчетаСЧА.Организация, ВложенныйЗапрос.Организация),
		|	ЕСТЬNULL(_ДатыРасчетаСЧА.СчетДоверительногоУправления, ВложенныйЗапрос.СчетДоверительногоУправления),
		|	ЕСТЬNULL(_ДатыРасчетаСЧА.Дата, ВложенныйЗапрос.Дата),
		|	_ДатыРасчетаСЧА.Дата ЕСТЬ НЕ NULL ,
		|	_ДатыРасчетаСЧА.Дата ЕСТЬ НЕ NULL 
		|		И ВложенныйЗапрос.Дата ЕСТЬ NULL,
		|	ВложенныйЗапрос.РегистрацияСтоимостиАктивов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Документы.Организация КАК Организация,
		|	_Документы.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_Документы.Дата КАК Дата,
		|	_Документы.ДатаРасчетаСЧА КАК ДатаРасчетаСЧА,
		|	_Документы.НеРассчитанаСЧА КАК НеРассчитанаСЧА,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _НастройкиФормированияСЧА.Период) = 0 КАК НеЗаданыНастройки,
		|	_Документы.РегистрацияСтоимостиАктивов КАК РегистрацияСтоимостиАктивов,
		|	"""" КАК Статус
		|ИЗ
		|	_Документы КАК _Документы
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПериодичностьНастроекПоСчетамДУ КАК _НастройкиФормированияСЧА
		|		ПО _Документы.СчетДоверительногоУправления = _НастройкиФормированияСЧА.СчетДоверительногоУправления
		|			И _Документы.Дата >= _НастройкиФормированияСЧА.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	_Документы.Дата,
		|	_Документы.РегистрацияСтоимостиАктивов,
		|	_Документы.НеРассчитанаСЧА,
		|	_Документы.Организация,
		|	_Документы.СчетДоверительногоУправления,
		|	_Документы.ДатаРасчетаСЧА";	
	
	#КонецОбласти 
	
	Запрос.УстановитьПараметр("ДополнитьДокументамиРассчитаннымиЗаПериод", ДополнитьДокументамиРассчитаннымиЗаПериод);	
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
